Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: This is true when the variable i is smaller than five.
es_es: Ésta es verdadera cuando la variable i es menor a cinco.

source: Note: If you happen to write a while loop that keeps on running, you can interrupt it by pressing CTRL-C (CTRL-Break on MS-Windows).
es_es: Nota: Si llega a escribir un ciclo «while» que nunca termina de ejecutarse, puede interrumpirlo presionando CTRL-C (o CTRL-Break en MS-Windows).

source: The ":echo" command prints its arguments.
es_es: La orden «:echo» imprime en pantalla los argumentos que se le introduzcan.

source: In this case the string "count is" and the value of the variable i.
es_es: En este caso son la cadena «cuenta es» y el valor de la variable i.

source: Since i is one, this will print:
es_es: Como i vale uno, se imprimirá:

source: Then there is the ":let i += 1" command.
es_es: Luego está la orden «:let i += 1».

source: This does the same thing as ":let i = i + 1".
es_es: Ésta tiene el mismo efecto que «:let i = i + 1».

source: This adds one to the variable i and assigns the new value to the same variable.
es_es: Le añade uno a la variable i y asigna el resultado a la misma variable.

source: We won't explain how |:for| and |range()| work until later.
es_es: El funcionamiento de |:for| y |range()| se explicará después.

source: Follow the links if you are impatient.
es_es: Siga los enlaces si no desea esperar.

source: Numbers can be decimal, hexadecimal or octal.
es_es: Los números pueden ser decimales, hexadecimales, u octales.

source: A hexadecimal number starts with "0x" or "0X".
es_es: Un número hexadecimal empieza con «0x» o «0X».

source: For example "0x1f" is decimal 31.
es_es: Por ejemplo, «0x1f» es 31 en decimal.

source: An octal number starts with a zero.
es_es: Un número octal empieza con cero.

source: "017" is decimal 15.
es_es: «017» es 15 en decimal.

source: Careful: don't put a zero before a decimal number, it will be interpreted as an octal number!
es_es: Tenga cuidado: no ponga ceros al comienzo de un número decimal, ¡será interpretado como un octal!

source: The ":echo" command always prints decimal numbers.
es_es: La orden «:echo» siempre muestra los números como decimales.

source: A number is made negative with a minus sign.
es_es: Se pueden obtener números negativos añadiéndoles un signo de resta.

source: This also works for hexadecimal and octal numbers.
es_es: Esto funciona también para números octales y hexadecimales.

source: A minus sign is also used for subtraction.
es_es: El signo menos también se usa para la substracción.

source: Compare this with the previous example: >
es_es: Compare lo siguiente con el ejemplo anterior: >

source: White space in an expression is ignored.
es_es: En las expresiones se ignoran los espacios en blanco.

source: However, it's recommended to use it for separating items, to make the expression easier to read.
es_es: Sin embargo, es recomendable usarlo para separar elementos, para hacer que las expresiones sean más legibles.

source: For example, to avoid the confusion with a negative number above, put a space between the minus sign and the following number: >
es_es: Por ejemplo, para evitar confundir el ejemplo anterior con un número negativo, ponga un espacio entre el signo de resta y el número que lo sigue: >

source: A variable name consists of ASCII letters, digits and the underscore.
es_es: Los nombres de variables pueden consistir de las letras del código ASCII, dígitos, y el guión bajo.

source: It cannot start with a digit.
es_es: No pueden empezar con dígitos.

source: Valid variable names are:
es_es: Los siguientes son nombres válidos de variables:

source: Invalid names are "foo+bar" and "6var".
es_es: «foo+bar» y «6var» no son nombres válidos.

source: These variables are global.
es_es: Estas variables son globales.

source: To see a list of currently defined variables use this command: >
es_es: Para ver un listado de las variables definidas actualmente, use la siguiente orden: >

source: Since "s:count" is local to this script, you can be sure that sourcing the "other.vim" script will not change this variable.
es_es: Ya que el ámbito de «s:cuenta» es local al script, puede estar seguro de que cargar el archivo «otro.vim» no hará cambios a dicha variable.

source: If "other.vim" also uses an "s:count" variable, it will be a different copy, local to that script.
es_es: Si «otro.vim» también usa una variable «s:cuenta», será una copia distinta, local al ámbito de ese script.

source: More about script-local variables here: |script-variable|.
es_es: Puede encontrar más información acerca de las variables locales a un script en |script-variable|.

source: There are more kinds of variables, see |internal-variables|.
es_es: Existen más clases de variables, consulte |internal-variables|.

source: The most often used ones are:
es_es: Las que se usan más frecuentemente son:

source: Variables take up memory and show up in the output of the ":let" command.
es_es: Las variables que aparecen en el listado que genera la orden «:let» consumen recursos de memoria.

source: To delete a variable use the ":unlet" command.
es_es: Para eliminar una variable use la orden «:unlet».

source: This deletes the script-local variable "s:count" to free up the memory it uses.
es_es: Esta orden elimina la variable «s:count», local al script actual, para liberar la memoria que ésta usa.

source: If you are not sure if the variable exists, and don't want an error message when it doesn't, append !: >
es_es: Si no está seguro de que una variable exista, y no quiere obtener mensajes de error si no existe, añada ! a la orden: >

source: When a script finishes, the local variables used there will not be automatically freed.
es_es: Cuando la ejecución de un script termina, no se liberan automáticamente los recursos usados por sus variables locales.

source: The next time the script executes, it can still use the old value.
es_es: La próxima vez que se ejecute el script, los valores antiguos estarán disponibles.

source: The "exists()" function checks if a variable has already been defined.
es_es: La función «exists()» comprueba la existencia de una variable.

source: Its argument is the name of the variable you want to check.
es_es: Recibe como argumento el nombre de la variable a comprobar.

source: Not the variable itself!
es_es: ¡No la variable como tal!

source: If you would do this: >
es_es: Si intenta esto: >

source: Then the value of s:call_count will be used as the name of the variable that exists() checks.
es_es: El valor de «s:cuenta_llamadas» se usará como el nombre de variable que exists() revisará.

source: The exclamation mark ! negates a value.
es_es: El símbolo de exclamación ! niega un valor.

source: When the value was true, it becomes false.
es_es: Cuando un valor es verdadero, se vuelve falso.

source: When it was false, it becomes true.
es_es: Cuando es falso, se vuelve verdadero.

source: You can read it as "not".
es_es: Puede leer este símbolo como «not» (negación lógica).

source: Thus "if !exists()" can be read as "if not exists()".
es_es: Así, «if !exists()» se lee como «if not exists()».

source: What Vim calls true is anything that is not zero.
es_es: Vim considera como verdadero cualquier valor distinto de cero.

source: Zero is false.
es_es: Cero equivale a falso.

source: Note: Vim automatically converts a string to a number when it is looking for a number.
es_es: Nota: Vim convierte las cadenas de texto a números de manera automática cuando se espera un número.

source: When using a string that doesn't start with a digit the resulting number is zero.
es_es: Cuando se hace esta conversión con una cadena que no empieza con un dígito el número resultante es cero.

source: Thus look out for this: > :if "true" < The "true" will be interpreted as a zero, thus as false!
es_es: Debido a esto, tenga cuidado con instrucciones como: > :if "verdadero" < en este caso, la cadena «verdadero» será interpretada como un cero, ¡y por tanto como falso!

source: So far only numbers were used for the variable value.
es_es: Hasta ahora sólo se han usado números como valores de variables.

source: Strings can be used as well.
es_es: También es posible usar cadenas de texto.

source: Numbers and strings are the basic types of variables that Vim supports.
es_es: Los tipos básicos de variables que Vim soporta son números y cadenas.

source: The type is dynamic, it is set each time when assigning a value to the variable with ":let".
es_es: El tipo de cada variable es dinámico, y se fija cada vez que se asigna un valor a una variable mediante «:let».

source: More about types in |41.8|.
es_es: Refiérase a |41.8| para más información acerca de tipos.

source: To assign a string value to a variable, you need to use a string constant.
es_es: Para asignar un valor de tipo cadena a una variable, debe usar una constante de cadena.

source: There are two types of these.
es_es: Hay dos tipos de estas constantes.

source: First the string in double quotes: >
es_es: El primero es la cadena con comillas dobles: >

source: Inside a single-quote string all the characters are as they are.
es_es: En una cadena de comillas sencillas todos los caracteres tienen solamente su significado literal.

source: Only the single quote itself is special: you need to use two to get one.
es_es: Sólo la comilla sencilla es especial: debe usar dos seguidas para obtener una dentro de una cadena.

source: A backslash is taken literally, thus you can't use it to change the meaning of the character after it.
es_es: La barra inversa se considera literalmente, por lo que no es posible usarla para cambiar el significado del carácter después de ella.

source: In double-quote strings it is possible to use special characters.
es_es: En las cadenas de comillas dobles es posible usar caracteres especiales.

source: Here are a few useful ones:
es_es: A continuación algunos de los más usados:

source: The last two are just examples.
es_es: Los últimos dos sólo son ejemplos.

source: The "\<name>" form can be used to include the special key "name".
es_es: Se puede usar la forma «\<nombre>» para incluir la tecla «nombre».

source: See |expr-quote| for the full list of special items in a string.
es_es: Consulte |expr-quote| para ver la lista completa de elementos especiales en una cadena de texto.

source: Vim has a rich, yet simple way to handle expressions.
es_es: Vim tiene una forma expresiva, pero sencilla, de manejar expresiones.

source: You can read the definition here: |expression-syntax|.
es_es: Puede leer la definición aquí: |expression-syntax|.

source: Here we will show the most common items.
es_es: A continuación mostraremos algunos de los elementos más comunes.

source: The numbers, strings and variables mentioned above are expressions by themselves.
es_es: Los números, cadenas, y las variables mencionadas anteriormente son expresiones por sí mismas.

source: Thus everywhere an expression is expected, you can use a number, string or variable.
es_es: Así que, en donde sea que se espere una expresión, puede usar un número, una cadena, o una variable.

source: Other basic items in an expression are:
es_es: Otros de los elementos comunes en una expresión son:

source: The &name form can be used to save an option value, set it to a new value, do something and restore the old value.
es_es: Puede usar la forma «&nombre» para guardar el valor de una opción, fijarla a un nuevo valor, hacer algo, y restaurar el valor original.

source: This makes sure the "The Start" pattern is used with the 'ignorecase' option off.
es_es: Con esto se asegura que el patrón «El Principio» se buscará con la opción 'ignorecase' desactivada.

source: Still, it keeps the value that the user had set.
es_es: Sin embargo, se conserva y restaura el valor que el usuario definió para la opción.

source: (Another way to do this would be to add "\C" to the pattern, see |/\C|.)
es_es: (Otra forma de hacer esta búsqueda es añadir «\C» al patrón, consulte |/\C|.)

source: It becomes more interesting if we combine these basic items.
es_es: Las cosas se hacen más interesantes si combinamos estos elementos básicos.

source: Let's start with mathematics on numbers:
es_es: Empecemos con operaciones matemáticas sobre números:

source: The usual precedence is used.
es_es: Se maneja la precendencia de operadores usual.

source: Grouping is done with braces.
es_es: Puede cambiar la precendencia de las operaciones usando paréntesis.

source: No surprises here.
es_es: Esto no es nada nuevo.

source: Strings can be concatenated with ".".
es_es: Puede unir cadenas usando «.».

source: When the ":echo" command gets multiple arguments, it separates them with a space.
es_es: Cuando recibe varios argumentos, la orden «:echo» los muestra en pantalla separados con espacios.

source: In the example the argument is a single expression, thus no space is inserted.
es_es: En el ejemplo anterior el argumento es una única expresión, por lo que no se insertan espacios.

source: If "a" evaluates to true "b" is used, otherwise "c" is used.
es_es: Si «a» se evalúa como verdadero, la expresión corresponderá a «b», y en caso contrario a «c».

source: "i is big" : "i is small" < i is small ~
es_es: "i es grande" : "i es pequeño" < i es pequeño ~

source: The ":if" commands executes the following statements, until the matching ":endif", only when a condition is met.
es_es: La orden «:if» ejecuta las órdenes a continuación de ella, hasta el «:endif» correspondiente, cuando se cumple la condición especificada.

source: The generic form is:
es_es: La forma genérica es:

source: Only when the expression {condition} evaluates to true (non-zero) will the {statements} be executed.
es_es: Las {instrucciones} se ejecutan únicamente cuando la expresión {condicion} es verdadera, esto es, diferente de cero.

source: These must still be valid commands.
es_es: Dichas instrucciones deben ser órdenes válidas.

source: If they contain garbage, Vim won't be able to find the ":endif".
es_es: Si las órdenes tienen errores de sintaxis, Vim no podrá encontrar el «:endif» correspondiente.

source: You can also use ":else".
es_es: También puede usar «:else».

source: The generic form for this is:
es_es: La forma genérica es:

source: The second {statements} is only executed if the first one isn't.
es_es: El segundo grupo de {instrucciones} sólo se ejecuta si el primero no lo hace.

source: Finally, there is ":elseif":
es_es: Finalmente, está «:elseif»

source: This works just like using ":else" and then "if", but without the need for an extra ":endif".
es_es: Esta orden funciona como «:else» seguido de «:if», pero tiene la ventaja de no requerir un «:endif» adicional.

source: A useful example for your vimrc file is checking the 'term' option and doing something depending upon its value: >
es_es: Un ejemplo útil que podría usar en su archivo vimrc es comprobar la opción 'term' y ejecutar órdenes diferentes de acuerdo a su valor: >

source: We already used some of them in the examples.
es_es: Ya hemos usado algunas de ellas en los ejemplos anteriores.

source: These are the most often used ones:
es_es: A continuación listamos las más utilizadas:

source: The result is one if the condition is met and zero otherwise.
es_es: El resultado es uno si la condición se cumple, y cero en caso contrario.

source: An example: >
es_es: Por ejemplo: >

source: The logic operators work both for numbers and strings.
es_es: Los operadores lógicos funcionan con números y con cadenas de texto.

source: When comparing two strings, the mathematical difference is used.
es_es: Al comparar dos cadenas, se trabaja con la diferencia matemática de las mismas.

source: This compares byte values, which may not be right for some languages.
es_es: Esto compara valores de bytes, lo que para algunos idiomas puede no entregar resultados correctos.

source: When comparing a string with a number, the string is first converted to a number.
es_es: Al comparar cadenas con números, la cadena es convertida a un número antes de hacer la comparación.

source: This is a bit tricky, because when a string doesn't look like a number, the number zero is used.
es_es: Debe tener en cuenta que, cuando el contenido de una cadena no se asemeja a un número, se usa el número cero.

source: The left item "a" is used as a string.
es_es: El operando de la izquierda, «a», se trata como una cadena.

source: The right item "b" is used as a pattern, like what's used for searching.
es_es: El operando de la derecha, «b», se trata como un patrón para una búsqueda de texto.

source: Notice the use of a single-quote string for the pattern.
es_es: Tenga en cuenta el uso de una cadena de comillas sencillas como patrón de búsqueda.

source: This is useful, because backslashes would need to be doubled in a double-quote string and patterns tend to contain many backslashes.
es_es: En este caso es útil porque las barras inversas tendrían que insertarse por partida doble en una cadena de comillas dobles, y los patrones de búsqueda suelen contener muchas barras inversas.

source: The 'ignorecase' option is used when comparing strings.
es_es: Al comparar cadenas se tiene en cuenta la opción 'ignorecase'.

source: When you don't want that, append "#" to match case and "?" to ignore case.
es_es: Si no desea este comportamiento, añada un «#» para diferenciar mayúsculas de minúsculas, o «?» para ignorar dicha diferencia.

source: Thus "==?" compares two strings to be equal while ignoring case.
es_es: Así, «==?» compara dos cadenas sin diferenciar mayúsculas de minúsculas.

source: And "!~#" checks if a pattern doesn't match, also checking the case of letters.
es_es: «!~#» revisa la no coincidencia de un patrón, teniendo en cuenta diferencias de mayúsculas y minúsculas.

source: For the full table see |expr-==|.
es_es: Puede consultar la tabla completa de operadores de comparación en |expr-==|.

source: The ":while" command was already mentioned.
es_es: Ya hemos mencionado la orden «:while».

source: Two more statements can be used in between the ":while" and the ":endwhile":
es_es: Hay dos instrucciones adicionales que pueden usarse entre «:while» y el «:endwhile» correspondiente:

source: :continue Jump back to the start of the while loop; the loop continues.
es_es: :continue Salta hasta el inicio del ciclo «while»; el ciclo continúa.

source: :break Jump forward to the ":endwhile"; the loop is discontinued.
es_es: :break Salta hasta después del «:endwhile»; provoca la terminación del ciclo.

source: The ":sleep" command makes Vim take a nap.
es_es: La orden «:sleep» hace que Vim tome una pausa.

source: The "50m" specifies fifty milliseconds.
es_es: El argumento «50m» especifica una duración de 50 milisegundos.

source: Another example is ":sleep 4", which sleeps for four seconds.
es_es: Otro ejemplo es «:sleep 4», que especifica una pausa de cuatro segundos.

source: So far the commands in the script were executed by Vim directly.
es_es: Hasta ahora, todas las órdenes mostradas han sido ejecutadas directamente por Vim.

source: The ":execute" command allows executing the result of an expression.
es_es: La orden «:execute» permite ejecutar el resultado de una expresión.

source: This is a very powerful way to build commands and execute them.
es_es: Ésta es una forma poderosa de construir y ejecutar órdenes.

source: An example is to jump to a tag, which is contained in a variable: >
es_es: Un ejemplo es saltar a una etiqueta, cuyo nombre está almacenado en una variable: >

source: The "." is used to concatenate the string "tag " with the value of variable "tag_name".
es_es: El «.» se usa para concatenar la cadena «tag » con el valor de la variable «nombre_etiqueta».

source: Suppose "tag_name" has the value "get_cmd", then the command that will be executed is: >
es_es: Si suponemos que «nombre_etiqueta» tiene el contenido «obtener_orden», entonces la orden que se ejecutará es: >

source: The ":execute" command can only execute colon commands.
es_es: La orden «:execute» sólo puede ejecutar órdenes de la línea de órdenes (órdenes Ex, que empiezan con «:»).

source: The ":normal" command executes Normal mode commands.
es_es: La orden «:normal» ejecuta órdenes del modo Normal.

source: However, its argument is not an expression but the literal command characters.
es_es: Sin embargo, su argumento no es una expresión, sino los caracteres literales de la orden.

source: This jumps to the first line and formats all lines with the "=" operator.
es_es: Se mueve hasta la primera línea y formatea todas las líneas usando el operador «=».

source: To make ":normal" work with an expression, combine ":execute" with it.
es_es: Para usar «:normal» con el resultado de una expresión, debe combinar «:execute» con dicha orden.

source: The variable "normal_commands" must contain the Normal mode commands.
es_es: La variables «ordenes_modo_normal» debe contener órdenes para el modo Normal.

source: Make sure that the argument for ":normal" is a complete command.
es_es: Asegúrese de que el argumento para «:normal» es una orden completa.

source: Otherwise Vim will run into the end of the argument and abort the command.
es_es: En caso contrario, Vim llegará al final del argumento e interrumpirá la orden.

source: For example, if you start Insert mode, you must leave Insert mode as well.
es_es: Por ejemplo, si inicia el modo Insertar, debe salir del mismo.

source: This works: >
es_es: Lo siguiente funciona adecuadamente: >

source: This inserts "new text " in the current line.
es_es: Esta orden inserta «texto nuevo» en la línea actual.

source: Notice the use of the special key "\<Esc>".
es_es: Observe el uso de la tecla especial «\<Esc>».

source: This avoids having to enter a real <Esc> character in your script.
es_es: Así se evita la necesidad de escribir un <Esc> real en el script.

source: A "&" character is prepended to "path", thus the argument to eval() is "&path".
es_es: Se antepone un «&» a «path», y así el argumento para eval() es «&path».

source: The result will then be the value of the 'path' option.
es_es: El resultado será el valor de la opción 'path'.

source: The same thing can be done with: > :exe 'let optval = &' . optname
es_es: Puede obtener el mismo resultado con: > :exe 'let optval = &' . optname

source: Vim defines many functions and provides a large amount of functionality that way.
es_es: Vim define muchas funciones y provee bastante funcionalidad a través de este mecanismo.

source: A few examples will be given in this section.
es_es: Aquí daremos algunos ejemplos.

source: You can find the whole list here: |functions|.
es_es: La referencia para la lista completa se encuentra en |functions|.

source: A function is called with the ":call" command.
es_es: Las funciones se llaman con la orden «:call».

source: The parameters are passed in between braces, separated by commas.
es_es: Los parámetros se introducen entre paréntesis, separados por comas.

source: This calls the search() function, with arguments "Date: " and "W".
es_es: Se invoca a la función search(), con los argumentos «Fecha: » y «W».

source: The search() function uses its first argument as a search pattern and the second one as flags.
es_es: La función search() usa su primer argumento como patrón de búsqueda y el segundo como una serie de opciones.

source: The "W" flag means the search doesn't wrap around the end of the file.
es_es: La opción «W» hace que la búsqueda termine al alcanzar el final del archivo.

source: A function can be called in an expression.
es_es: También es posible invocar funciones en expresiones.

source: There are many functions.
es_es: Vim cuenta con muchas funciones.

source: We will mention them here, grouped by what they are used for.
es_es: Las mencionaremos aquí, agrupadas de acuerdo a su funcionalidad.
